# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

#tap 'homebrew/dupes' deprecated
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
#tap 'homebrew/homebrew-php' deprecated
tap 'caskroom/drivers'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Réseau
brew 'curl'
#brew 'dnsmasq'
#brew 'openssh'
brew 'openssl'
brew 'rsync'
#brew 'storm'
brew 'wget'
#cask 'controlplane'
#cask 'tigervpn'
#cask 'transmission'
#mas 'ForkLift', id: 412448059
cask 'wireshark'
cask 'filezilla'
brew 'unbound'
brew 'nmap'

# Terminal
#brew 'autojump'
#brew 'joe'
#brew 'thefuck'
cask 'iterm2'
brew 'zsh'
brew ’zsh-syntax-highlighting’

# Améliorations d'interface et usage
#cask 'bartender'
cask 'coconutbattery'
#cask 'rcdefaultapp'
#cask 'rightzoom'
#mas 'Amphetamine', id: 937984704
#mas 'AutoMute', id: 1118136179
#mas 'BetterSnapTool', id: 417375580

# Utilitaires divers
cask 'appcleaner'
cask 'alfred'
#cask 'appdelete'
#cask 'appshelf'
#cask 'disk-inventory-x'
#cask 'macid'
#cask 'muzzle'
#cask 'qlmarkdown'
#cask 'quicklook-csv'
#cask 'quicklook-json'
#cask 'rocket'
#cask 'yemuzip'
#mas '1Password', id: 443987910
#mas 'Renamer', id: 402286241
mas 'The Unarchiver', id: 425424353
cask 'keepassxc'
cask 'spectacle'
cask 'teamviewer'
cask 'yubico-yubikey-piv-manager'
brew 'lnav'
brew 'gpg'
brew 'gnu-sed'


# Backup et synchro
brew 'mackup'
#cask 'carbon-copy-cloner'
#cask 'crashplan'
#cask 'google-backup-and-sync'
cask 'synology-drive'

# Web
cask 'firefox'
cask 'google-chrome'
#mas 'Opera', id: 404764921

# Développement
brew 'docker'
brew 'git'
brew 'mysql@5.5'
brew 'node'
brew 'httpd'
brew 'php@5.6'
brew 'php@7.0'
brew 'php@7.1'
brew 'php@7.2'
brew 'php-cs-fixer'
brew 'pkg-config'
#brew 'ruby'
#cask 'duet' #transformer son iPad en 2e écran
cask 'font-meslo-for-powerline'
#cask 'ghostlab'
cask 'java6'
#cask 'reflector'
#cask 'sequel-pro'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
mas 'Xcode', id: 497799835
cask 'phpstorm'
cask 'sublime-text'
brew 'hugo'
brew 'composer'
brew 'certbot'
brew 'gd'
brew 'jq'
brew 'memcached'
brew 'mcrypt'
brew 'python'
brew 'qcachegrind'

# Communication
#cask 'colloquy'
#cask 'rambox'
cask 'skype'
mas 'Slack', id: 803453959
mas 'Tweetbot', id: 557168941
cask 'gotomeeting'

# Images
brew 'graphicsmagick'
#brew 'gsl'
brew 'imagemagick@6'
cask 'imageoptim'
#mas 'Boxy SVG', id: 611658502
#mas 'Skitch', id: 425955336
#mas 'Sip', id: 507257563

# Vidéos
#brew 'ffmpeg'
#brew 'youtube-dl'
#cask 'catch'
#cask 'handbrake'
#cask 'licecap'
#cask 'molotov'
#cask 'screenflow'
#cask 'subler'
#cask 'subsmarine'
cask 'vlc'
#mas 'GIF Brewery 3', id: 1081413713
#mas 'iFlicks 2', id: 731062389
#mas 'Screeny', id: 440991524

# Musique
cask 'spotify'
#cask 'xld'
#mas 'Export for iTunes', id: 880764359
#mas 'I Love Stars', id: 402642760

# Photo
#cask 'adobe-creative-cloud'
#mas 'gps4cam', id: 704400176

# Divertissement
#cask 'logitech-harmony'
#cask 'steam'

# Bureautique
#cask 'libreoffice'
#cask 'macdown'
#cask 'typora'
#cask 'vienna'
cask 'microsoft-office'
#mas 'Evernote', id: 406056744
